Autodesk.Revit.DB.Structure.RebarHostCategory
Rebar host category
Since:
2015
Since:
2015

Autodesk.Revit.DB.Structure.RebarHostCategory.SlabEdge
Slab Edge.

Autodesk.Revit.DB.Structure.RebarHostCategory.Stairs
Stairs.

Autodesk.Revit.DB.Structure.RebarHostCategory.StructuralFoundation
Structural Foundation.

Autodesk.Revit.DB.Structure.RebarHostCategory.Floor
Floor.

Autodesk.Revit.DB.Structure.RebarHostCategory.Wall
Wall.

Autodesk.Revit.DB.Structure.RebarHostCategory.StructuralFraming
Structural Framing.

Autodesk.Revit.DB.Structure.RebarHostCategory.StructuralColumn
Structural Column.

Autodesk.Revit.DB.Structure.RebarHostCategory.Part
Part.

Autodesk.Revit.DB.Structure.RebarHostCategory.Other
Unknown or invalid host.